In [55]:
import mysql.connector
import pandas as pd
print ("successfully imported")

successfully imported

In [69]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\lenovo\anaconda3\lib\site-packages (8.4.0)Note: you may need to restart the kernel to use updated packages.

In [70]:
connection = mysql.connector.connect(host = "localhost", 
                                     user = "root", 
                                     password = "Bh@nuvegi1999",
                                     database = "e_com")

##connection = mysql.connector.connect('e_com')
cursorObject = connection.cursor()
print("connected successfully")

connected successfully

In [58]:
## question 1

table_creation_qurey =   """ create table supplier(`SUPP_ID` int primary key,`SUPP_NAME` varchar(50), 
                            `SUPP_CITY` varchar(50), SUPP_PHONE varchar(10));
                            
                            create table customer (`CUS_ID` INT NOT NULL, `CUS_NAME` VARCHAR(20) NULL DEFAULT NULL, 
                            `CUS_PHONE` VARCHAR(10), `CUS_CITY` varchar(30) ,`CUS_GENDER` CHAR,PRIMARY KEY (`CUS_ID`));
                        
                        create table category(`CAT_ID` INT NOT NULL, `CAT_NAME` VARCHAR(20) NULL DEFAULT NULL,
                        PRIMARY KEY (`CAT_ID`));
                        
                        create table product (`PRO_ID` INT NOT NULL, `PRO_NAME` VARCHAR(20) NULL DEFAULT NULL,
                        `PRO_DESC` VARCHAR(60) NULL DEFAULT NULL, `CAT_ID` INT NOT NULL,
                        PRIMARY KEY (`PRO_ID`),FOREIGN KEY (`CAT_ID`) REFERENCES CATEGORY (`CAT_ID`));
                        
                        create table product_details (`PROD_ID` INT NOT NULL, `PRO_ID` INT NOT NULL,
                        `SUPP_ID` INT NOT NULL, `PROD_PRICE` INT NOT NULL,PRIMARY KEY (`PROD_ID`),
                        FOREIGN KEY (`PRO_ID`) REFERENCES PRODUCT (`PRO_ID`),
                        FOREIGN KEY (`SUPP_ID`) REFERENCES SUPPLIER(`SUPP_ID`));
                        
                        create table orders (`ORD_ID` INT NOT NULL, `ORD_AMOUNT` INT NOT NULL, `ORD_DATE` DATE,
                        `CUS_ID` INT NOT NULL, `PROD_ID` INT NOT NULL,PRIMARY KEY (`ORD_ID`),
                        FOREIGN KEY (`CUS_ID`) REFERENCES CUSTOMER(`CUS_ID`),
                        FOREIGN KEY (`PROD_ID`) REFERENCES PRODUCT_DETAILS(`PROD_ID`));
                        
                        create table rating (`RAT_ID` INT NOT NULL, `CUS_ID` INT NOT NULL, `SUPP_ID` INT NOT NULL,
                        `RAT_RATSTARS` INT NOT NULL,PRIMARY KEY (`RAT_ID`),
                        FOREIGN KEY (`SUPP_ID`) REFERENCES SUPPLIER (`SUPP_ID`),
                        FOREIGN KEY (`CUS_ID`) REFERENCES CUSTOMER(`CUS_ID`));"""
cursorObject.execute(table_creation_qurey)
print("created successfully")

created successfully

In [59]:
connection.close()
connection = mysql.connector.connect(host = "localhost", 
user = "root", 
password = "Bh@nuvegi1999",
database = "e_com")


cursorObject = connection.cursor()
print("Reconnected successfully")

Reconnected successfully

In [60]:
## question 2
insert_query = "insert into supplier (SUPP_ID,SUPP_NAME, SUPP_CITY, SUPP_PHONE) values (%s, %s, %s, %s)"
val = [(1,'Rajesh Retails' ,'Delhi',1234567890 ),
       (2,'Appario Ltd.' ,'Mumbai' ,2589631470),
       (3, 'Knome products' , 'Bangalore' ,9785462315 ),
       (4, 'Bansal Retails' , 'Kochi' , 8975463285),
       (5, 'Mittal Ltd.' ,'Lucknow ', 7898456532 )]

cursorObject.executemany(insert_query, val)
connection.commit()
print("supplier table executed successfully")

supplier table executed successfully

In [61]:
insert_query = "insert into customer(CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER)values (%s, %s, %s, %s, %s)"
val = [( 1 , 'AAKASH' , 9999999999 , 'DELHI' , 'M' ),
       ( 2 , 'AMAN' , 9785463215 , 'NOIDA' ,'M'),
       ( 3 ,' NEHA' , 9999999998 , 'MUMBAI' , 'F'  ),
       ( 4 , 'MEGHA' , 9994562399 , 'KOLKATA' , 'F' ),
       ( 5 ,' PULKIT' , 7895999999 ,' LUCKNOW ','M')]

cursorObject.executemany(insert_query, val)
connection.commit()
print("customer table executed successfully")

customer table executed successfully

In [62]:
insert_query = "insert into category(CAT_ID, CAT_NAME) values(%s, %s)"
val = [( 1 , 'BOOKS' ),
       ( 2 , 'GAMES '),
       ( 3 , 'GROCERIES '),
       ( 4 , 'ELECTRONICS'),
       ( 5 , 'CLOTHES ' )]
cursorObject.executemany(insert_query, val)
connection.commit()
print("category table executed successfully")

category table executed successfully

In [63]:
insert_query = "insert into product(PRO_ID,PRO_NAME, PRO_DESC, CAT_ID) values (%s, %s, %s, %s)"
val =[ ( 1 , 'GTA V', ' DFJDJFDJFDJFDJFJF' , 2  ),
      ( 2 , 'TSHIRT ',' DFDFJDFJDKFD', 5 ),
      ( 3 , 'ROG LAPTOP',  'DFNTTNTNTERND',  4 ),
      ( 4 , 'OATS' ,'REURENTBTOTH' , 3 ),
      ( 5 , 'HARRY POTTER', 'NBEMCTHTJTH' , 1  )]

cursorObject.executemany(insert_query, val)
connection.commit()
print("product table executed successfully")

product table executed successfully

In [64]:
insert_query = "insert into product_details (PROD_ID,PRO_ID,SUPP_ID ,PROD_PRICE) values(%s, %s, %s, %s)"
val = [(1 , 1 , 2 , 1500 ),
(2 , 3 , 5 , 30000 ),
(3 , 5 , 1 , 3000 ),
(4 , 2 , 3 , 2500 ),
(5 , 4 , 1 , 1000 )]

cursorObject.executemany(insert_query, val)
connection.commit()
print("product_details table executed successfully")

product_details table executed successfully

In [65]:
insert_query = "INSERT INTO orders ( ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) values(%s, %s, %s, %s, %s)"
val = [( 20 , 1500 , "2021-10-12" , 3, 5 ),
       ( 25 , 30500 , "2021-09-16" , 5, 2 ),
       ( 26 , 2000 , "2021-10-05" , 1, 1 ),
       ( 30 , 3500 , "2021-08-16" , 4, 3 ),
       ( 50 , 2000 , "2021-10-06" , 2, 1 )]

cursorObject.executemany(insert_query, val)
connection.commit()

In [66]:
insert_query = "insert into rating (RAT_ID,CUS_ID,SUPP_ID,RAT_RATSTARS) values(%s, %s, %s, %s)"
val = [(  1 , 2 , 2 , 4 ),
       (  2 , 3 , 4 , 3 ),
       (  3 , 5 , 1 , 5 ), 
       (  4 , 1 , 3 , 2 ),
       (  5 , 4 , 5 , 4 )]
cursorObject.executemany(insert_query, val)
connection.commit()
print("rating table executed successfully")

rating table executed successfully

In [75]:
## question 3

Query3 = """SELECT CUS_GENDER, COUNT(*) AS Number_of_Customers
FROM customer c
JOIN `orders` o ON c.CUS_ID = o.CUS_ID
WHERE o.ORD_AMOUNT >= 3000
GROUP BY CUS_GENDER; """

cursorObject.execute(Query3)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CUS_GENDER', 'COUNT'])
output_df

  CUS_GENDER  COUNT
0          F      1
1          M      1

In [77]:
## question 4

Query4 = """select o.*,PRO_NAME 
from orders o 
join product_details p ON o.PROD_ID=p.PROD_ID
join product pr ON pr.PRO_ID=p.PRO_ID
where  CUS_ID= 2;"""

cursorObject.execute(Query4)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['ORD_ID', 'ORD_AMOUNT', 'ORD_DATE','CUS_ID', 'PROD_ID', 'PRO_NAME'])
output_df

   ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PROD_ID PRO_NAME
0      50        2000  2021-10-06       2        1    GTA V

In [81]:
## question 5

Query5 = """select s.*
  from supplier s
  join product_details pr ON s.SUPP_ID=pr.SUPP_ID
   GROUP BY SUPP_ID 
   HAVING COUNT(DISTINCT PROD_ID) > 1;"""

cursorObject.execute(Query5)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME', 'SUPP_CITY', 'SUPP_PHONE'])
output_df

   SUPP_ID       SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

In [82]:
## question 6

Query6 = """select c.*
  from category c
  join product p ON p.CAT_ID=c.CAT_ID
  join product_details pr ON pr.PRO_ID=p.PRO_ID
  join orders o ON o.PROD_ID=pr.PROD_ID
  having  MIN(ORD_AMOUNT);"""

cursorObject.execute(Query6)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CAT_ID', 'CAT_NAME'])
output_df

   CAT_ID    CAT_NAME
0       3  GROCERIES

In [83]:
## question 7

Query7 = """select p.PRO_ID, p.PRO_NAME
from product p
join product_details pr ON p.PRO_ID=pr.PRO_ID
join orders o ON pr.PROD_ID=o.PROD_ID
where ORD_DATE > '2021-10-05';"""

cursorObject.execute(Query7)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['PRO_ID', 'PRO_NAME'])
output_df

   PRO_ID PRO_NAME
0       4     OATS
1       1    GTA V

In [84]:
## question 8

Query8 = """select s.SUPP_NAME, s.SUPP_ID, r.RAT_RATSTARS, c.CUS_NAME
  from supplier s
  join rating r ON s.SUPP_ID = r.SUPP_ID
  join customer c ON r.CUS_ID = c.CUS_ID
  ORDER BY r.RAT_RATSTARS DESC
LIMIT 3;
"""

cursorObject.execute(Query8)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['SUPP_NAME', 'SUPP_ID','RAT_RATSTARS','CUS_NAME'])
output_df

        SUPP_NAME  SUPP_ID  RAT_RATSTARS CUS_NAME
0  Rajesh Retails        1             5   PULKIT
1    Appario Ltd.        2             4     AMAN
2     Mittal Ltd.        5             4    MEGHA

In [85]:
## question 9

Query9 = """select CUS_NAME, CUS_GENDER 
from customer WHERE CUS_NAME LIKE 'A%' OR CUS_NAME LIKE '%A'; """

cursorObject.execute(Query9)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CUS_NAME', 'CUS_GENDER'])
output_df

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

In [92]:
## question 10

Query10 = """select sum(ORD_AMOUNT) as total_order_amount 
from orders o 
join customer c ON c.CUS_ID = o.CUS_ID
where CUS_GENDER = 'M';"""

cursorObject.execute(Query10)
output = cursorObject.fetchall()

print("amount is ", output);

amount is  [(Decimal('34500'),)]

In [95]:
## question 11

Query11 = """select * from customer left outer join `orders` on customer.CUS_ID= `orders`.CUS_ID;"""

cursorObject.execute(Query11)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CUS_ID',' CUS_NAME', 'CUS_PHONE', 'CUS_CITY',
                                          ' CUS_GENDER','ORD_ID', 'ORD_AMOUNT', 
                                          'ORD_DATE', 'CUS_ID', 'PROD_ID'])
output_df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID
0,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,2,1
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,3,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,4,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,5,2